app/Http/Helpers.php

select * from `business_settings` where `type` = 'vendor_system_activation' limit 1
---
    function filter_products($products) {
        $verified_sellers = verified_sellers_id();
        if(BusinessSetting::where('type', 'vendor_system_activation')->first()->value == 1){

select * from `business_settings` where `type` = 'system_default_currency' limit 1
select * from `currencies` where `currencies`.`id` = '27' limit 1
select * from `currencies` where `code` = 'BDT' limit 1
---
    function convert_price($price)
    {
        $business_settings = BusinessSetting::where('type', 'system_default_currency')->first();
        if($business_settings != null){
            $currency = Currency::find($business_settings->value);
            $price = floatval($price) / floatval($currency->exchange_rate);
        }

        $code = \App\Models\Currency::findOrFail(\App\Models\BusinessSetting::where('type', 'system_default_currency')->first()->value)->code;
        if(Session::has('currency_code')){
            $currency = Currency::where('code', Session::get('currency_code', $code))->first();
        }
        else{
            $currency = Currency::where('code', $code)->first();

select * from `business_settings` where `type` = 'decimal_separator' limit 1
select * from `business_settings` where `type` = 'no_of_decimals' limit 1
select * from `business_settings` where `type` = 'symbol_format' limit 1
---
    function format_price($price)
    {
        if (BusinessSetting::where('type', 'decimal_separator')->first()->value == 1) {
            $fomated_price = number_format($price, BusinessSetting::where('type', 'no_of_decimals')->first()->value);
        }
        else {
            $fomated_price = number_format($price, BusinessSetting::where('type', 'no_of_decimals')->first()->value , ',' , ' ');
        }

         if(BusinessSetting::where('type', 'symbol_format')->first()->value == 1){

select * from `products` where `products`.`id` = 4645 limit 1
---
    function home_base_price($id)
    {
        $product = Product::findOrFail($id);

select * from `products` where `products`.`id` = 4645 limit 1
select * from `flash_deals` where `status` = 1
---
    function home_discounted_base_price($id)
    {
        $product = Product::findOrFail($id);
        $price = $product->app_unit_price;

        $flash_deals = \App\Models\FlashDeal::where('status', 1)->get();

select * from `products` where `products`.`id` = 564 limit 1
---
    function home_flash_deal_price($id)
    {
        $product = Product::findOrFail($id);

select * from `business_settings` where `type` = 'system_default_currency' limit 1
select * from `currencies` where `code` = 'BDT' limit 1
---
    function currency_symbol()
    {
        $code = \App\Models\Currency::findOrFail(\App\Models\BusinessSetting::where('type', 'system_default_currency')->first()->value)->code;
        if(Session::has('currency_code')){
            $currency = Currency::where('code', Session::get('currency_code', $code))->first();
        }
        else{
            $currency = Currency::where('code', $code)->first();

select * from `products` where `products`.`id` = 564 limit 1
---
    function homeBasePrice($id)
    {
        $product = Product::findOrFail($id);

select * from `translations` where `lang` = 'en' and `lang_key` = 'Best Selling' limit 1
insert into `translations` (`lang`, `lang_key`, `lang_value`, `updated_at`, `created_at`) values ('en', 'Notifications has been sent successfully', 'Notifications has been sent successfully', '2024-05-25 06:22:49', '2024-05-25 06:22:49')
select * from `translations` where `lang_key` = 'Best Selling' and `lang` = 'en' limit 1
---
function translate($key, $lang = null){
    if($lang == null){
        $lang = App::getLocale();
    }

    $translation_def = Translation::where('lang', env('DEFAULT_LANGUAGE', 'en'))->where('lang_key', $key)->first();
    if($translation_def == null){
        $translation_def = new Translation;
        $translation_def->lang = env('DEFAULT_LANGUAGE', 'en');
        $translation_def->lang_key = $key;
        $translation_def->lang_value = $key;
        $translation_def->save();
    }

    //Check for session lang
    $translation_locale = Translation::where('lang_key', $key)->where('lang', $lang)->first();

select * from `uploads` where `uploads`.`id` = '17524' and `uploads`.`deleted_at` is null limit 1
---
    function uploaded_asset($id)
    {
        if (($asset = \App\Models\Upload::find($id)) != null) {

select * from `business_settings` where `type` = 'site_icon' limit 1
---
    function get_setting($key, $default = null)
    {
        $setting = BusinessSetting::where('type', $key)->first();

select * from `uploads` where `uploads`.`id` = '12321' and `uploads`.`deleted_at` is null limit 1
---
    function get_images($given_ids, $with_trashed = false)
    {
        $givenids = is_null($given_ids) ? [] : explode(",", $given_ids);
        $ids = is_array($given_ids)
            ? $given_ids
            : $givenids;

        return $with_trashed
            ? Upload::withTrashed()->whereIn('id', $ids)->get()
            : Upload::whereIn('id', $ids)->get();

select * from `business_settings` where `type` = 'site_icon' limit 1
---
    function checkout_done($order_id, $payment)
    {
        $order = Order::findOrFail($order_id);
        $order->payment_status = 'paid';
        $order->payment_details = $payment;
        $order->save();

        if (\App\Models\Addon::where('unique_identifier', 'affiliate_system')->first() != null && \App\Models\Addon::where('unique_identifier', 'affiliate_system')->first()->activated) {
            $affiliateController = new AffiliateController;
            $affiliateController->processAffiliatePoints($order);
        }

        if (\App\Models\Addon::where('unique_identifier', 'club_point')->first() != null && \App\Models\Addon::where('unique_identifier', 'club_point')->first()->activated) {
            if (Auth::check()) {
                $clubpointController = new ClubPointController;
                $clubpointController->processClubPoints($order);
            }
        }
        if (\App\Models\Addon::where('unique_identifier', 'seller_subscription')->first() == null || !\App\Models\Addon::where('unique_identifier', 'seller_subscription')->first()->activated) {
            if (BusinessSetting::where('type', 'category_wise_commission')->first()->value != 1) {

select * from `staff` where `user_id` = 9 limit 1
---
function getWearhouseBuUserId($id){

    $staff = Staff::where('user_id',$id)->first();