app/Http/Helpers.php

    function currency_symbol()
    {
        $code = \App\Models\Currency::findOrFail(\App\Models\BusinessSetting::where('type', 'system_default_currency')->first()->value)->code;
        if(Session::has('currency_code')){
            $currency = Currency::where('code', Session::get('currency_code', $code))->first();
        }
        else{
            $currency = Currency::where('code', $code)->first();
---
select * from `business_settings` where `type` = 'system_default_currency' limit 1
select * from `currencies` where `code` = 'BDT' limit 1

function translate($key, $lang = null){
    if($lang == null){
        $lang = App::getLocale();
    }

    $translation_def = Translation::where('lang', env('DEFAULT_LANGUAGE', 'en'))->where('lang_key', $key)->first();
    if($translation_def == null){
        $translation_def = new Translation;
        $translation_def->lang = env('DEFAULT_LANGUAGE', 'en');
        $translation_def->lang_key = $key;
        $translation_def->lang_value = $key;
        $translation_def->save();
    }

    //Check for session lang
    $translation_locale = Translation::where('lang_key', $key)->where('lang', $lang)->first();
---
select * from `translations` where `lang` = 'en' and `lang_key` = 'Best Selling' limit 1
insert into `translations` (`lang`, `lang_key`, `lang_value`, `updated_at`, `created_at`) values ('en', 'Product Type Qty', 'Product Type Qty', '2024-05-29 04:24:27', '2024-05-29 04:24:27')
select * from `translations` where `lang_key` = 'Best Selling' and `lang` = 'en' limit 1