app/Http/Controllers/AccCoaController.php

    public function index()
    {
        $data['title'] = 'List of Accounts';
        $data['userList'] = AccCoa::distinct()->where('IsActive', 1)->orderBy('HeadName')->get();
---
select distinct * from `acc_coa` where `IsActive` = 1 order by `HeadName` asc