app/Http/Controllers/InvoiceController.php

select * from `currencies` where `currencies`.`id` = '27' limit 1
select * from `languages` where `code` = 'en' limit 1
select * from `orders` where `orders`.`id` = '2' limit 1
---
    public function invoice_download($id)
    {
        if(Session::has('currency_code')){
            $currency_code = Session::get('currency_code');
        }
        else{
            $currency_code = Currency::findOrFail(get_setting('system_default_currency'))->code;
        }
        if(Language::where('code', Session::get('locale', Config::get('app.locale')))->first()->rtl == 1){
            $direction = 'rtl';
            $text_align = 'right';
            $not_text_align = 'left';
        }else{
            $direction = 'ltr';
            $text_align = 'left';
            $not_text_align = 'right';
        }

        if($currency_code == 'BDT'){
            $font_family = "'Hind Siliguri','sans-serif'";
        }elseif($currency_code == 'AMD'){
            $font_family = "'arnamu','sans-serif'";
        }elseif($currency_code == 'ILS'){
            $font_family = "'Varela Round','sans-serif'";
        }elseif($currency_code == 'AED' || $currency_code == 'EGP'){
            $font_family = "'XBRiyaz','sans-serif'";
        }else{
            $font_family = "'Roboto','sans-serif'";
        }

        $order = Order::findOrFail($id);