app/Http/Controllers/NotificationController.php

    public function store(Request $request)
    {

        $userIds = $request->user_id;
        $senderId = auth()->id();

        if(empty($request->user_id[0])){
            $tokens = User::whereNotNull('device_token')->groupBy('device_token')
            ->select('id','device_token');
        }else{
            $tokens = User::whereNotNull('device_token')->groupBy('device_token')
            ->select('id','device_token')->whereIn('id',$userIds);
        }

        $alltokens = $tokens->get()->pluck('device_token')->toarray();
---
select `id`, `device_token` from `users` where `device_token` is not null group by `device_token`

                $notification->sender_id = $senderId;
                $notification->title = $request->title;
                $notification->message = $request->message;
                $notification->save();
---
insert into `notifications` (`user_id`, `sender_id`, `title`, `message`, `updated_at`, `created_at`) values ('', 9, 'fgfjfj', 'fjfjfjfjfj', '2024-05-25 06:22:49', '2024-05-25 06:22:49')