app/Http/Controllers/PosController.php

    public function online_orders_show(Request $request){
        $orderdetails = OrderDetail::where('order_id',$request->order_id)
        ->select('id','order_id','product_id','quantity','price','shipping_cost','discount')->get();
---
select `id`, `order_id`, `product_id`, `quantity`, `price`, `shipping_cost`, `discount` from `order_details` where `order_id` = '2'