app/Http/Controllers/PurchaseHistoryController.php

select * from `orders` where `orders`.`id` = '31896' limit 1
update `orders` set `delivery_viewed` = 1, `payment_status_viewed` = 1, `orders`.`updated_at` = '2024-06-08 04:39:13' where `id` = 31896
---
    public function purchase_history_details(Request $request)
    {
        $order = Order::findOrFail($request->order_id);
        $order->delivery_viewed = 1;
        $order->payment_status_viewed = 1;
        $order->save();