app/Http/Controllers/RefundRequestController.php

select count(*) as aggregate from `refund_requests` where `refund_status` = 0
---
    public function admin_index()
    {
        $refunds = RefundRequest::where('refund_status', 0)->latest()->paginate(15);