app/Http/Controllers/ReportController.php

select SUM(order_details.price) AS total_order_price, COUNT(DISTINCT orders.user_id) AS total_customers, COUNT(DISTINCT orders.id) AS total_orders from `products` inner join `categories` on `products`.`category_id` = `categories`.`id` left join `order_details` on `products`.`id` = `order_details`.`product_id` left join `orders` on `orders`.`id` = `order_details`.`order_id` left join `wearhouses` on `wearhouses`.`id` = `orders`.`warehouse` where `num_of_sale` > 0 and year(`orders`.`delivered_date`) = 2022 and `orders`.`warehouse` = 3 limit 1
---
public function sales_report(Request $request)
{
    $warehouseIds = $request->input('warehouse', []);
    $start_date = $request->input('start_date', date('Y-m-01', strtotime('-3 years')));
    $end_date = $request->input('end_date', date('Y-m-t'));

    $currentYear = Carbon::now()->year;
    $startYear = $currentYear - 2;

    $productsData = [];

    $warehouses = Wearhouse::all();
    if (!empty($warehouseIds)) {
        $warehouses = $warehouses->whereIn('id', $warehouseIds);
    }

    foreach ($warehouses as $warehouse) {
        $totals = [];
        $totalCustomers = [];
        $totalOrders = [];

        for ($year = $startYear; $year <= $currentYear; $year++) {
            $products = Product::join('categories', 'products.category_id', '=', 'categories.id')
                ->leftJoin('order_details', 'products.id', '=', 'order_details.product_id')
                ->leftJoin('orders', 'orders.id', '=', 'order_details.order_id')
                ->leftJoin('wearhouses', 'wearhouses.id', '=', 'orders.warehouse')
                ->where('num_of_sale', '>', 0)
                ->whereYear('orders.delivered_date', $year)
                ->where('orders.warehouse', $warehouse->id)
                ->select(
                    DB::raw('SUM(order_details.price) AS total_order_price'),
                    DB::raw('COUNT(DISTINCT orders.user_id) AS total_customers'),
                    DB::raw('COUNT(DISTINCT orders.id) AS total_orders')
                )
                ->first();

select `order_from`, SUM(order_details.price) AS total_order_price, COUNT(DISTINCT orders.user_id) AS total_customers, COUNT(DISTINCT orders.id) AS total_orders from `orders` inner join `order_details` on `orders`.`id` = `order_details`.`order_id` where year(`orders`.`created_at`) = 2020 and `orders`.`canceled_by` is null and `orders`.`warehouse` = 1 group by `order_from`
---
public function sales_by_platform(Request $request)
{
    $warehouseIds = $request->input('warehouse', []);
    $start_date = $request->input('start_date', date('Y-m-01', strtotime('-5 years')));
    $end_date = $request->input('end_date', date('Y-m-t'));

    $currentYear = Carbon::now()->year;
    $startYear = $currentYear - 4;

    $warehouses = Wearhouse::all();
    if (!empty($warehouseIds)) {
        $warehouses = $warehouses->whereIn('id', $warehouseIds);
    }

    $platformData = [];

    foreach ($warehouses as $warehouse) {
        for ($year = $startYear; $year <= $currentYear; $year++) {
            $platforms = Order::whereYear('orders.created_at', $year)
                ->whereNull('orders.canceled_by')
                ->where('orders.warehouse', $warehouse->id)
                ->groupBy('order_from')
                ->select(
                    'order_from',
                    DB::raw('SUM(order_details.price) AS total_order_price'),
                    DB::raw('COUNT(DISTINCT orders.user_id) AS total_customers'),
                    DB::raw('COUNT(DISTINCT orders.id) AS total_orders')
                )
                ->join('order_details', 'orders.id', '=', 'order_details.order_id')
                ->get();

select `transfers`.*, `products`.`purchase_price` from `transfers` left join `products` on `transfers`.`product_id` = `products`.`id` where `transfers`.`date` between '2024-05-01' and '2024-05-31' and `transfers`.`from_wearhouse_id` = '1' order by `transfers`.`date` asc
---
    public function transfer_list_report(Request $request)
{
    $wearhouse = $request->warehouse;
    $to_wearhouse = $request->to_warehouse;
    $product_id = $request->product_id;
    $sort_by = null;
    $start_date = date('Y-m-01');
    $end_date = date('Y-m-t');

    if (!empty($request->start_date)) {
        $start_date = $request->start_date;
        $end_date = $request->end_date;
    }

    $transfer = Transfer::leftJoin('products', 'transfers.product_id', '=', 'products.id')
        ->whereBetween('transfers.date', [$start_date, $end_date])
        ->orderBy('transfers.date', 'asc');

    if (!empty($wearhouse)) {
        $transfer = $transfer->where('transfers.from_wearhouse_id', $wearhouse);
    }
    if (!empty($to_wearhouse)) {
        $transfer = $transfer->where('transfers.to_wearhouse_id', $to_wearhouse);
    }
    if (!empty($product_id)) {
        $transfer = $transfer->where('transfers.product_id', $product_id);
    }

    $transfer = $transfer->select('transfers.*', 'products.purchase_price')->get();