app/Http/Controllers/ReportController.php

select SUM(order_details.price) AS total_order_price, COUNT(DISTINCT orders.user_id) AS total_customers, COUNT(DISTINCT orders.id) AS total_orders from `products` inner join `categories` on `products`.`category_id` = `categories`.`id` left join `order_details` on `products`.`id` = `order_details`.`product_id` left join `orders` on `orders`.`id` = `order_details`.`order_id` left join `wearhouses` on `wearhouses`.`id` = `orders`.`warehouse` where `num_of_sale` > 0 and year(`orders`.`delivered_date`) = 2022 and `orders`.`warehouse` = 1 limit 1
---
                'name' => Carbon::create(null, $month, 1)->format('F')
            ];
            for ($year = $currentYear; $year >= $startYear; $year--) {
                $products = Product::join('categories', 'products.category_id', '=', 'categories.id')
                    ->leftJoin('order_details', 'products.id', '=', 'order_details.product_id')
                    ->leftJoin('orders', 'orders.id', '=', 'order_details.order_id')
                    ->leftJoin('wearhouses', 'wearhouses.id', '=', 'orders.warehouse')
                    ->where('num_of_sale', '>', 0)
                    ->whereYear('orders.delivered_date', $year)
                    ->whereMonth('orders.delivered_date', $month)
                    ->where('orders.warehouse', $warehouse->id)
                    ->select(
                        'products.name as product_name', 'products.purchase_price', 'products.id as productId',
                        'categories.name as category_name',
                        'order_details.price as sale_price', 'order_details.quantity as order_qty',
                        'orders.delivered_date', 'orders.code', 'orders.id as orderId', 'orders.warehouse', 'wearhouses.name as warehouse_name',
                        DB::raw('sum(order_details.price) AS total_order_price'),
                        DB::raw('sum(order_details.quantity) AS total_order_qty'),
                        DB::raw('count(product_id) AS num_of_sale')
                    )
                    ->groupBy('products.id', 'orders.delivered_date')
                    ->orderBy('num_of_sale', 'desc')
                    ->get();